<!-- add-pr-comment:add-pr-comment -->

## Terragrunt Plan Output
🔗 **[Download Full Plan Output](https://github.com/genopsx/labs-terraform/actions/runs/13744603829)**
# ```
# $(cat terragrunt_plan_output.txt)  # ✅ Reads stored output
# ```
# ## Terragrunt Plan Out from stdout or stderr
# ```
# Acquiring state lock. This may take a few moments...
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_region.current: Reading...[0m[0m
[0m[1mdata.aws_route53_zone.parent_hosted_zone: Reading...[0m[0m
[0m[1mdata.aws_region.current: Reading...[0m[0m
[0m[1mmodule.cluster.module.kms.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.ebs_kms_key.data.aws_region.current: Reading...[0m[0m
[0m[1mmodule.ebs_kms_key.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.cluster.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_region.current: Read complete after 0s [id=eu-west-1][0m
[0m[1mdata.aws_region.current: Read complete after 0s [id=eu-west-1][0m
[0m[1mmodule.ebs_kms_key.data.aws_region.current: Read complete after 0s [id=eu-west-1][0m
[0m[1mdata.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.cluster.module.kms.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.cluster.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mmodule.ebs_kms_key.module.ebs_kms_key.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.cluster.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.cluster.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799][0m
[0m[1mdata.aws_eks_cluster_auth.eks: Reading...[0m[0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_partition.current: Reading...[0m[0m
[0m[1mmodule.ebs_kms_key.module.ebs_kms_key.data.aws_partition.current[0]: Reading...[0m[0m
[0m[1mdata.aws_eks_cluster_auth.eks: Read complete after 0s [id=eks-dev-eu-west-1-cluster-01-infra-01][0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_partition.current: Read complete after 0s [id=aws][0m
[0m[1mmodule.ebs_kms_key.module.ebs_kms_key.data.aws_partition.current[0]: Read complete after 0s [id=aws][0m
[0m[1mmodule.cluster.data.aws_caller_identity.current[0]: Reading...[0m[0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_caller_identity.current: Reading...[0m[0m
[0m[1mmodule.ebs_kms_key.data.aws_caller_identity.current: Read complete after 0s [id=955769636964][0m
[0m[1mmodule.cluster.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=955769636964][0m
[0m[1mmodule.ebs_kms_key.module.ebs_kms_key.data.aws_caller_identity.current[0]: Read complete after 0s [id=955769636964][0m
[0m[1mdata.aws_caller_identity.current: Read complete after 0s [id=955769636964][0m
[0m[1mdata.aws_route53_zone.parent_hosted_zone: Read complete after 0s [id=Z007063513EIRKOFIWQ9J][0m
[0m[1mmodule.cluster.data.aws_caller_identity.current[0]: Read complete after 0s [id=955769636964][0m
[0m[1mmodule.cluster.data.aws_iam_session_context.current[0]: Reading...[0m[0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_caller_identity.current: Read complete after 0s [id=955769636964][0m
[0m[1mmodule.cluster.data.aws_iam_session_context.current[0]: Read complete after 1s [id=arn:aws:sts::955769636964:assumed-role/deployment-terragrunt-genopsx-eu-west-1-955769636964/githubactionsession][0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_iam_policy_document.assume_role_policy[0]: Reading...[0m[0m
[0m[1mmodule.fargate["my-app-eks-fargate"].module.fargate_profile.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2165255211][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
 [36m<=[0m read (data resources)[0m

Terraform will perform the following actions:

[1m  # aws_ec2_tag.cluster_private["subnet-4"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-4"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.cluster_private["subnet-5"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-5"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.cluster_private["subnet-6"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-6"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.cluster_public["subnet-1"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-1"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.cluster_public["subnet-2"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-2"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.cluster_public["subnet-3"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m resource_id = "subnet-3"
      [32m+[0m[0m value       = "owned"
    }

[1m  # aws_ec2_tag.karpenter_private["subnet-4"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-4"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/private"
    }

[1m  # aws_ec2_tag.karpenter_private["subnet-5"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-5"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/private"
    }

[1m  # aws_ec2_tag.karpenter_private["subnet-6"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_private" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-6"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/private"
    }

[1m  # aws_ec2_tag.karpenter_public["subnet-1"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-1"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/public"
    }

[1m  # aws_ec2_tag.karpenter_public["subnet-2"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-2"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/public"
    }

[1m  # aws_ec2_tag.karpenter_public["subnet-3"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "karpenter_public" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "karpenter.sh/discovery"
      [32m+[0m[0m resource_id = "subnet-3"
      [32m+[0m[0m value       = "eks-dev-eu-west-1-cluster-01-infra-01/public"
    }

[1m  # aws_route53_record.ns[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "ns" {
      [32m+[0m[0m allow_overwrite = (known after apply)
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 300
      [32m+[0m[0m type            = "NS"
      [32m+[0m[0m zone_id         = "Z007063513EIRKOFIWQ9J"
    }

[1m  # aws_route53_zone.cluster_zone[0m will be created
[0m  [32m+[0m[0m resource "aws_route53_zone" "cluster_zone" {
      [32m+[0m[0m arn                 = (known after apply)
      [32m+[0m[0m comment             = "Separate zone for eks-dev-eu-west-1-cluster-01-infra-01 cluster"
      [32m+[0m[0m force_destroy       = true
      [32m+[0m[0m id                  = (known after apply)
      [32m+[0m[0m name                = "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
      [32m+[0m[0m name_servers        = (known after apply)
      [32m+[0m[0m primary_name_server = (known after apply)
      [32m+[0m[0m tags                = (known after apply)
      [32m+[0m[0m tags_all            = (known after apply)
      [32m+[0m[0m zone_id             = (known after apply)
    }

[1m  # module.certificate.aws_acm_certificate.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate" "this" {
      [32m+[0m[0m arn                       = (known after apply)
      [32m+[0m[0m domain_name               = "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
      [32m+[0m[0m domain_validation_options = [
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "*.eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
          [32m+[0m[0m {
              [32m+[0m[0m domain_name           = "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
              [32m+[0m[0m resource_record_name  = (known after apply)
              [32m+[0m[0m resource_record_type  = (known after apply)
              [32m+[0m[0m resource_record_value = (known after apply)
            },
        ]
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m key_algorithm             = (known after apply)
      [32m+[0m[0m not_after                 = (known after apply)
      [32m+[0m[0m not_before                = (known after apply)
      [32m+[0m[0m pending_renewal           = (known after apply)
      [32m+[0m[0m renewal_eligibility       = (known after apply)
      [32m+[0m[0m renewal_summary           = (known after apply)
      [32m+[0m[0m status                    = (known after apply)
      [32m+[0m[0m subject_alternative_names = [
          [32m+[0m[0m "*.eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
          [32m+[0m[0m "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com",
        ]
      [32m+[0m[0m tags                      = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all                  = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m type                      = (known after apply)
      [32m+[0m[0m validation_emails         = (known after apply)
      [32m+[0m[0m validation_method         = "DNS"

      [32m+[0m[0m options {
          [32m+[0m[0m certificate_transparency_logging_preference = "ENABLED"
        }
    }

[1m  # module.certificate.aws_acm_certificate_validation.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_acm_certificate_validation" "this" {
      [32m+[0m[0m certificate_arn         = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m validation_record_fqdns = (known after apply)

      [32m+[0m[0m timeouts {}
    }

[1m  # module.certificate.aws_route53_record.validation[0][0m will be created
[0m  [32m+[0m[0m resource "aws_route53_record" "validation" {
      [32m+[0m[0m allow_overwrite = true
      [32m+[0m[0m fqdn            = (known after apply)
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m name            = (known after apply)
      [32m+[0m[0m records         = (known after apply)
      [32m+[0m[0m ttl             = 60
      [32m+[0m[0m type            = (known after apply)
      [32m+[0m[0m zone_id         = (known after apply)
    }

[1m  # module.cluster.data.tls_certificate.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "tls_certificate" "this" {
      [32m+[0m[0m certificates = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m url          = (known after apply)
    }

[1m  # module.cluster.aws_cloudwatch_log_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_cloudwatch_log_group" "this" {
      [32m+[0m[0m arn               = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m log_group_class   = (known after apply)
      [32m+[0m[0m name              = "/aws/eks/eks-dev-eu-west-1-cluster-01-infra-01/cluster"
      [32m+[0m[0m name_prefix       = (known after apply)
      [32m+[0m[0m retention_in_days = 90
      [32m+[0m[0m skip_destroy      = false
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "/aws/eks/eks-dev-eu-west-1-cluster-01-infra-01/cluster"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Name"                = "/aws/eks/eks-dev-eu-west-1-cluster-01-infra-01/cluster"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
    }

[1m  # module.cluster.aws_ec2_tag.cluster_primary_security_group["Environment"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_primary_security_group" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "Environment"
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m value       = "dev"
    }

[1m  # module.cluster.aws_ec2_tag.cluster_primary_security_group["Terragrunt"][0m will be created
[0m  [32m+[0m[0m resource "aws_ec2_tag" "cluster_primary_security_group" {
      [32m+[0m[0m id          = (known after apply)
      [32m+[0m[0m key         = "Terragrunt"
      [32m+[0m[0m resource_id = (known after apply)
      [32m+[0m[0m value       = "true"
    }

[1m  # module.cluster.aws_eks_access_entry.this["CrossplaneRole"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "this" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = (known after apply)
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = [
          [32m+[0m[0m "eks-dev-eu-west-1-cluster-01-infra-01-devepers-user-group",
        ]
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::955769636964:role/CrossplaneRole"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # module.cluster.aws_eks_access_entry.this["Terraform"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "this" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = (known after apply)
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = [
          [32m+[0m[0m "eks-dev-eu-west-1-cluster-01-infra-01-devepers-user-group",
        ]
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::955769636964:user/Terraform"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # module.cluster.aws_eks_access_entry.this["cluster_creator"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_entry" "this" {
      [32m+[0m[0m access_entry_arn  = (known after apply)
      [32m+[0m[0m cluster_name      = (known after apply)
      [32m+[0m[0m created_at        = (known after apply)
      [32m+[0m[0m id                = (known after apply)
      [32m+[0m[0m kubernetes_groups = (known after apply)
      [32m+[0m[0m modified_at       = (known after apply)
      [32m+[0m[0m principal_arn     = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"
      [32m+[0m[0m tags              = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all          = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m type              = "STANDARD"
      [32m+[0m[0m user_name         = (known after apply)
    }

[1m  # module.cluster.aws_eks_access_policy_association.this["CrossplaneRole_role"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "this" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::955769636964:role/CrossplaneRole"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m namespaces = [
              [32m+[0m[0m "kube-system",
            ]
          [32m+[0m[0m type       = "namespace"
        }
    }

[1m  # module.cluster.aws_eks_access_policy_association.this["Terraform_user"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "this" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSViewPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::955769636964:user/Terraform"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m namespaces = [
              [32m+[0m[0m "kube-system",
            ]
          [32m+[0m[0m type       = "namespace"
        }
    }

[1m  # module.cluster.aws_eks_access_policy_association.this["cluster_creator_admin"][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_access_policy_association" "this" {
      [32m+[0m[0m associated_at = (known after apply)
      [32m+[0m[0m cluster_name  = (known after apply)
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m modified_at   = (known after apply)
      [32m+[0m[0m policy_arn    = "arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy"
      [32m+[0m[0m principal_arn = "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964"

      [32m+[0m[0m access_scope {
          [32m+[0m[0m type = "cluster"
        }
    }

[1m  # module.cluster.aws_eks_cluster.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_cluster" "this" {
      [32m+[0m[0m arn                           = (known after apply)
      [32m+[0m[0m bootstrap_self_managed_addons = true
      [32m+[0m[0m certificate_authority         = (known after apply)
      [32m+[0m[0m cluster_id                    = (known after apply)
      [32m+[0m[0m created_at                    = (known after apply)
      [32m+[0m[0m enabled_cluster_log_types     = [
          [32m+[0m[0m "api",
          [32m+[0m[0m "audit",
          [32m+[0m[0m "authenticator",
          [32m+[0m[0m "controllerManager",
          [32m+[0m[0m "scheduler",
        ]
      [32m+[0m[0m endpoint                      = (known after apply)
      [32m+[0m[0m id                            = (known after apply)
      [32m+[0m[0m identity                      = (known after apply)
      [32m+[0m[0m name                          = "eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m platform_version              = (known after apply)
      [32m+[0m[0m role_arn                      = (known after apply)
      [32m+[0m[0m status                        = (known after apply)
      [32m+[0m[0m tags                          = {
          [32m+[0m[0m "Environment"           = "dev"
          [32m+[0m[0m "Terragrunt"            = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m tags_all                      = {
          [32m+[0m[0m "Data-classification"   = "internal"
          [32m+[0m[0m "Environment"           = "dev"
          [32m+[0m[0m "Managed-by"            = "terragrunt"
          [32m+[0m[0m "Organization"          = "genopsx"
          [32m+[0m[0m "Terragrunt"            = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m version                       = "1.31"

      [32m+[0m[0m access_config {
          [32m+[0m[0m authentication_mode                         = "API_AND_CONFIG_MAP"
          [32m+[0m[0m bootstrap_cluster_creator_admin_permissions = false
        }

      [32m+[0m[0m encryption_config {
          [32m+[0m[0m resources = [
              [32m+[0m[0m "secrets",
            ]

          [32m+[0m[0m provider {
              [32m+[0m[0m key_arn = (known after apply)
            }
        }

      [32m+[0m[0m kubernetes_network_config {
          [32m+[0m[0m ip_family         = "ipv4"
          [32m+[0m[0m service_ipv4_cidr = (known after apply)
          [32m+[0m[0m service_ipv6_cidr = (known after apply)

          [32m+[0m[0m elastic_load_balancing (known after apply)
        }

      [32m+[0m[0m timeouts {}

      [32m+[0m[0m upgrade_policy (known after apply)

      [32m+[0m[0m vpc_config {
          [32m+[0m[0m cluster_security_group_id = (known after apply)
          [32m+[0m[0m endpoint_private_access   = false
          [32m+[0m[0m endpoint_public_access    = true
          [32m+[0m[0m public_access_cidrs       = [
              [32m+[0m[0m "0.0.0.0/0",
            ]
          [32m+[0m[0m security_group_ids        = (known after apply)
          [32m+[0m[0m subnet_ids                = [
              [32m+[0m[0m "subnet-1",
              [32m+[0m[0m "subnet-2",
              [32m+[0m[0m "subnet-3",
              [32m+[0m[0m "subnet-4",
              [32m+[0m[0m "subnet-5",
              [32m+[0m[0m "subnet-6",
            ]
          [32m+[0m[0m vpc_id                    = (known after apply)
        }
    }

[1m  # module.cluster.aws_iam_openid_connect_provider.oidc_provider[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_openid_connect_provider" "oidc_provider" {
      [32m+[0m[0m arn             = (known after apply)
      [32m+[0m[0m client_id_list  = [
          [32m+[0m[0m "sts.amazonaws.com",
        ]
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m tags            = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "eks-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all        = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Name"                = "eks-dev-eu-west-1-cluster-01-infra-01-eks-irsa"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m thumbprint_list = (known after apply)
      [32m+[0m[0m url             = (known after apply)
    }

[1m  # module.cluster.aws_iam_policy.cluster_encryption[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "cluster_encryption" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Cluster encryption policy to allow cluster role to utilize CMK provided"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = "eks-dev-eu-west-1-cluster-01-infra-01-cluster-ClusterEncryption"
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
    }

[1m  # module.cluster.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = [
                          [32m+[0m[0m "sts:TagSession",
                          [32m+[0m[0m "sts:AssumeRole",
                        ]
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks.amazonaws.com"
                        }
                      [32m+[0m[0m Sid       = "EKSClusterAssumeRole"
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.cluster.aws_iam_role_policy_attachment.cluster_encryption[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "cluster_encryption" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
    }

[1m  # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
    }

[1m  # module.cluster.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
    }

[1m  # module.cluster.aws_security_group.cluster[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "cluster" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "EKS cluster security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "eks-dev-eu-west-1-cluster-01-infra-01-cluster-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Name"                                                        = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
          [32m+[0m[0m "Terragrunt"                                                  = "true"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification"                                         = "internal"
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Managed-by"                                                  = "terragrunt"
          [32m+[0m[0m "Name"                                                        = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
          [32m+[0m[0m "Organization"                                                = "genopsx"
          [32m+[0m[0m "Terragrunt"                                                  = "true"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m vpc_id                 = "vpc-1234"
    }

[1m  # module.cluster.aws_security_group.node[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "node" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "EKS node shared security group"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "eks-dev-eu-west-1-cluster-01-infra-01-node-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Name"                                                        = "eks-dev-eu-west-1-cluster-01-infra-01-node"
          [32m+[0m[0m "Terragrunt"                                                  = "true"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification"                                         = "internal"
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Managed-by"                                                  = "terragrunt"
          [32m+[0m[0m "Name"                                                        = "eks-dev-eu-west-1-cluster-01-infra-01-node"
          [32m+[0m[0m "Organization"                                                = "genopsx"
          [32m+[0m[0m "Terragrunt"                                                  = "true"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m vpc_id                 = "vpc-1234"
    }

[1m  # module.cluster.aws_security_group_rule.cluster["ingress_nodes_443"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "cluster" {
      [32m+[0m[0m description              = "Node groups to cluster API"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["egress_all"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all egress"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_443"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node groups"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_4443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 4443/tcp webhook"
      [32m+[0m[0m from_port                = 4443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 4443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_6443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 6443/tcp webhook"
      [32m+[0m[0m from_port                = 6443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 6443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_8443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 8443/tcp webhook"
      [32m+[0m[0m from_port                = 8443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_9443_webhook"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node 9443/tcp webhook"
      [32m+[0m[0m from_port                = 9443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 9443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_cluster_kubelet"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Cluster API to node kubelets"
      [32m+[0m[0m from_port                = 10250
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 10250
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_nodes_ephemeral"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node ingress on ephemeral ports"
      [32m+[0m[0m from_port                = 1025
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 65535
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_self_coredns_tcp"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node CoreDNS"
      [32m+[0m[0m from_port                = 53
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 53
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.aws_security_group_rule.node["ingress_self_coredns_udp"][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "node" {
      [32m+[0m[0m description              = "Node to node CoreDNS UDP"
      [32m+[0m[0m from_port                = 53
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "udp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 53
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.cluster.time_sleep.this[0][0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "this" {
      [32m+[0m[0m create_duration = "30s"
      [32m+[0m[0m id              = (known after apply)
      [32m+[0m[0m triggers        = {
          [32m+[0m[0m "cluster_certificate_authority_data" = (known after apply)
          [32m+[0m[0m "cluster_endpoint"                   = (known after apply)
          [32m+[0m[0m "cluster_name"                       = (known after apply)
          [32m+[0m[0m "cluster_service_cidr"               = (known after apply)
          [32m+[0m[0m "cluster_version"                    = "1.31"
        }
    }

[1m  # module.eks_addons.aws_eks_addon.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_addon" "this" {
      [32m+[0m[0m addon_name                  = "amazon-cloudwatch-observability"
      [32m+[0m[0m addon_version               = (known after apply)
      [32m+[0m[0m arn                         = (known after apply)
      [32m+[0m[0m cluster_name                = "eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m configuration_values        = (known after apply)
      [32m+[0m[0m created_at                  = (known after apply)
      [32m+[0m[0m id                          = (known after apply)
      [32m+[0m[0m modified_at                 = (known after apply)
      [32m+[0m[0m resolve_conflicts_on_create = "OVERWRITE"
      [32m+[0m[0m tags                        = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all                    = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
    }

[1m  # module.nodes["my-app-eks-x86"].data.aws_iam_policy_document.additional_policy[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "additional_policy" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "ec2:*",
              [32m+[0m[0m "ecr:BatchCheckLayerAvailability",
              [32m+[0m[0m "ecr:BatchGetImage",
              [32m+[0m[0m "ecr:DescribeImageScanFindings",
              [32m+[0m[0m "ecr:DescribeImages",
              [32m+[0m[0m "ecr:DescribeRepositories",
              [32m+[0m[0m "ecr:GetAuthorizationToken",
              [32m+[0m[0m "ecr:GetDownloadUrlForLayer",
              [32m+[0m[0m "ecr:GetLifecyclePolicy",
              [32m+[0m[0m "ecr:GetLifecyclePolicyPreview",
              [32m+[0m[0m "ecr:GetRepositoryPolicy",
              [32m+[0m[0m "ecr:ListImages",
              [32m+[0m[0m "ecr:ListTagsForResource",
              [32m+[0m[0m "elasticfilesystem:*",
              [32m+[0m[0m "events:*",
              [32m+[0m[0m "iam:PassRole",
              [32m+[0m[0m "logs:*",
            ]
          [32m+[0m[0m effect    = "Allow"
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
        }
    }

[1m  # module.nodes["my-app-eks-x86"].aws_autoscaling_policy.eks_autoscaling_policy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_autoscaling_policy" "eks_autoscaling_policy" {
      [32m+[0m[0m arn                     = (known after apply)
      [32m+[0m[0m autoscaling_group_name  = (known after apply)
      [32m+[0m[0m enabled                 = true
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m metric_aggregation_type = (known after apply)
      [32m+[0m[0m name                    = (known after apply)
      [32m+[0m[0m policy_type             = "TargetTrackingScaling"

      [32m+[0m[0m target_tracking_configuration {
          [32m+[0m[0m disable_scale_in = false
          [32m+[0m[0m target_value     = 30

          [32m+[0m[0m predefined_metric_specification {
              [32m+[0m[0m predefined_metric_type = "ASGAverageCPUUtilization"
            }
        }
    }

[1m  # module.nodes["my-app-eks-x86"].random_id.additional_id[0m will be created
[0m  [32m+[0m[0m resource "random_id" "additional_id" {
      [32m+[0m[0m b64_std     = (known after apply)
      [32m+[0m[0m b64_url     = (known after apply)
      [32m+[0m[0m byte_length = 8
      [32m+[0m[0m dec         = (known after apply)
      [32m+[0m[0m hex         = (known after apply)
      [32m+[0m[0m id          = (known after apply)
    }

[1m  # module.cluster.module.kms.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "Default"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::955769636964:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:CancelKeyDeletion",
              [32m+[0m[0m "kms:Create*",
              [32m+[0m[0m "kms:Delete*",
              [32m+[0m[0m "kms:Describe*",
              [32m+[0m[0m "kms:Disable*",
              [32m+[0m[0m "kms:Enable*",
              [32m+[0m[0m "kms:Get*",
              [32m+[0m[0m "kms:ImportKeyMaterial",
              [32m+[0m[0m "kms:List*",
              [32m+[0m[0m "kms:Put*",
              [32m+[0m[0m "kms:ReplicateKey",
              [32m+[0m[0m "kms:Revoke*",
              [32m+[0m[0m "kms:ScheduleKeyDeletion",
              [32m+[0m[0m "kms:TagResource",
              [32m+[0m[0m "kms:UntagResource",
              [32m+[0m[0m "kms:Update*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyAdministration"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::955769636964:role/deployment-terragrunt-genopsx-eu-west-1-955769636964",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:Decrypt",
              [32m+[0m[0m "kms:DescribeKey",
              [32m+[0m[0m "kms:Encrypt",
              [32m+[0m[0m "kms:GenerateDataKey*",
              [32m+[0m[0m "kms:ReEncrypt*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyUsage"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m (known after apply),
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.cluster.module.kms.aws_kms_alias.this["cluster"][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_alias" "this" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m name           = "alias/eks/eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m name_prefix    = (known after apply)
      [32m+[0m[0m target_key_arn = (known after apply)
      [32m+[0m[0m target_key_id  = (known after apply)
    }

[1m  # module.cluster.module.kms.aws_kms_key.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "this" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m description                        = "eks-dev-eu-west-1-cluster-01-infra-01 cluster encryption key"
      [32m+[0m[0m enable_key_rotation                = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = false
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m rotation_period_in_days            = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Environment"           = "dev"
          [32m+[0m[0m "Terragrunt"            = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Data-classification"   = "internal"
          [32m+[0m[0m "Environment"           = "dev"
          [32m+[0m[0m "Managed-by"            = "terragrunt"
          [32m+[0m[0m "Organization"          = "genopsx"
          [32m+[0m[0m "Terragrunt"            = "true"
          [32m+[0m[0m "terraform-aws-modules" = "eks"
        }
    }

[1m  # module.ebs_kms_key.module.ebs_kms_key.data.aws_iam_policy_document.this[0][0m will be read during apply
  # (config refers to values not yet known)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "this" {
      [32m+[0m[0m id                        = (known after apply)
      [32m+[0m[0m json                      = (known after apply)
      [32m+[0m[0m minified_json             = (known after apply)
      [32m+[0m[0m override_policy_documents = []
      [32m+[0m[0m source_policy_documents   = []

      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "Default"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::955769636964:root",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:CancelKeyDeletion",
              [32m+[0m[0m "kms:Create*",
              [32m+[0m[0m "kms:Delete*",
              [32m+[0m[0m "kms:Describe*",
              [32m+[0m[0m "kms:Disable*",
              [32m+[0m[0m "kms:Enable*",
              [32m+[0m[0m "kms:Get*",
              [32m+[0m[0m "kms:ImportKeyMaterial",
              [32m+[0m[0m "kms:List*",
              [32m+[0m[0m "kms:Put*",
              [32m+[0m[0m "kms:ReplicateKey",
              [32m+[0m[0m "kms:Revoke*",
              [32m+[0m[0m "kms:ScheduleKeyDeletion",
              [32m+[0m[0m "kms:TagResource",
              [32m+[0m[0m "kms:UntagResource",
              [32m+[0m[0m "kms:Update*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyAdministration"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:sts::955769636964:assumed-role/deployment-terragrunt-genopsx-eu-west-1-955769636964/githubactionsession",
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:Decrypt",
              [32m+[0m[0m "kms:DescribeKey",
              [32m+[0m[0m "kms:Encrypt",
              [32m+[0m[0m "kms:GenerateDataKey*",
              [32m+[0m[0m "kms:ReEncrypt*",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyServiceRolesASG"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
                  [32m+[0m[0m (known after apply),
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
      [32m+[0m[0m statement {
          [32m+[0m[0m actions   = [
              [32m+[0m[0m "kms:CreateGrant",
            ]
          [32m+[0m[0m resources = [
              [32m+[0m[0m "*",
            ]
          [32m+[0m[0m sid       = "KeyServiceRolesASGPersistentVol"

          [32m+[0m[0m condition {
              [32m+[0m[0m test     = "Bool"
              [32m+[0m[0m values   = [
                  [32m+[0m[0m "true",
                ]
              [32m+[0m[0m variable = "kms:GrantIsForAWSResource"
            }

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "arn:aws:iam::955769636964:role/aws-service-role/autoscaling.amazonaws.com/AWSServiceRoleForAutoScaling",
                  [32m+[0m[0m (known after apply),
                ]
              [32m+[0m[0m type        = "AWS"
            }
        }
    }

[1m  # module.ebs_kms_key.module.ebs_kms_key.aws_kms_alias.this["eks/kms/sao/eks-dev-eu-west-1-cluster-01-infra-01/ebs"][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_alias" "this" {
      [32m+[0m[0m arn            = (known after apply)
      [32m+[0m[0m id             = (known after apply)
      [32m+[0m[0m name           = "alias/eks/kms/sao/eks-dev-eu-west-1-cluster-01-infra-01/ebs"
      [32m+[0m[0m name_prefix    = (known after apply)
      [32m+[0m[0m target_key_arn = (known after apply)
      [32m+[0m[0m target_key_id  = (known after apply)
    }

[1m  # module.ebs_kms_key.module.ebs_kms_key.aws_kms_key.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_kms_key" "this" {
      [32m+[0m[0m arn                                = (known after apply)
      [32m+[0m[0m bypass_policy_lockout_safety_check = false
      [32m+[0m[0m customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      [32m+[0m[0m description                        = "Customer managed key to encrypt EKS managed node group volumes"
      [32m+[0m[0m enable_key_rotation                = true
      [32m+[0m[0m id                                 = (known after apply)
      [32m+[0m[0m is_enabled                         = true
      [32m+[0m[0m key_id                             = (known after apply)
      [32m+[0m[0m key_usage                          = "ENCRYPT_DECRYPT"
      [32m+[0m[0m multi_region                       = false
      [32m+[0m[0m policy                             = (known after apply)
      [32m+[0m[0m rotation_period_in_days            = (known after apply)
      [32m+[0m[0m tags                               = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all                           = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
    }

[1m  # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_eks_fargate_profile.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_fargate_profile" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m cluster_name           = "eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m fargate_profile_name   = "demo"
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m pod_execution_role_arn = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-4",
          [32m+[0m[0m "subnet-5",
          [32m+[0m[0m "subnet-6",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }

      [32m+[0m[0m selector {
          [32m+[0m[0m namespace = "demo"
        }

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "5m"
        }
    }

[1m  # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = jsonencode(
            {
              [32m+[0m[0m Statement = [
                  [32m+[0m[0m {
                      [32m+[0m[0m Action    = "sts:AssumeRole"
                      [32m+[0m[0m Condition = {
                          [32m+[0m[0m ArnLike = {
                              [32m+[0m[0m "aws:SourceArn" = "arn:aws:eks:eu-west-1:955769636964:fargateprofile/eks-dev-eu-west-1-cluster-01-infra-01/*"
                            }
                        }
                      [32m+[0m[0m Effect    = "Allow"
                      [32m+[0m[0m Principal = {
                          [32m+[0m[0m Service = "eks-fargate-pods.amazonaws.com"
                        }
                    },
                ]
              [32m+[0m[0m Version   = "2012-10-17"
            }
        )
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eks-dev-eu-west-1-cluster-01-infra-01-fargate-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.additional["AmazonEKSFargatePodExecutionRolePolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-fargate-role"
    }

[1m  # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKSFargatePodExecutionRolePolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSFargatePodExecutionRolePolicy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-fargate-role"
    }

[1m  # module.fargate["my-app-eks-fargate"].module.fargate_profile.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-fargate-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.additional_policy.aws_iam_policy.policy[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_policy" "policy" {
      [32m+[0m[0m arn              = (known after apply)
      [32m+[0m[0m attachment_count = (known after apply)
      [32m+[0m[0m description      = "Additional policy for eks node group"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = (known after apply)
      [32m+[0m[0m name_prefix      = (known after apply)
      [32m+[0m[0m path             = "/"
      [32m+[0m[0m policy           = (known after apply)
      [32m+[0m[0m policy_id        = (known after apply)
      [32m+[0m[0m tags             = {
          [32m+[0m[0m "PolicyDescription" = "Policy created using example from data source"
        }
      [32m+[0m[0m tags_all         = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "PolicyDescription"   = "Policy created using example from data source"
        }
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_caller_identity.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_caller_identity" "current" {
      [32m+[0m[0m account_id = (known after apply)
      [32m+[0m[0m arn        = (known after apply)
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m user_id    = (known after apply)
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_iam_policy_document.assume_role_policy[0][0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_iam_policy_document" "assume_role_policy" {
      [32m+[0m[0m id            = (known after apply)
      [32m+[0m[0m json          = (known after apply)
      [32m+[0m[0m minified_json = (known after apply)

      [32m+[0m[0m statement {
          [32m+[0m[0m actions = [
              [32m+[0m[0m "sts:AssumeRole",
            ]
          [32m+[0m[0m sid     = "EKSNodeAssumeRole"

          [32m+[0m[0m principals {
              [32m+[0m[0m identifiers = [
                  [32m+[0m[0m "ec2.amazonaws.com",
                ]
              [32m+[0m[0m type        = "Service"
            }
        }
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.data.aws_partition.current[0m will be read during apply
  # (depends on a resource or a module with changes pending)
[0m [36m<=[0m[0m data "aws_partition" "current" {
      [32m+[0m[0m dns_suffix         = (known after apply)
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m partition          = (known after apply)
      [32m+[0m[0m reverse_dns_prefix = (known after apply)
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_eks_node_group.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_eks_node_group" "this" {
      [32m+[0m[0m ami_type               = "AL2_x86_64"
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m capacity_type          = "ON_DEMAND"
      [32m+[0m[0m cluster_name           = "eks-dev-eu-west-1-cluster-01-infra-01"
      [32m+[0m[0m disk_size              = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m instance_types         = [
          [32m+[0m[0m "m7i.4xlarge",
        ]
      [32m+[0m[0m node_group_name        = (known after apply)
      [32m+[0m[0m node_group_name_prefix = "my-app-eks-x86-"
      [32m+[0m[0m node_role_arn          = (known after apply)
      [32m+[0m[0m release_version        = (known after apply)
      [32m+[0m[0m resources              = (known after apply)
      [32m+[0m[0m status                 = (known after apply)
      [32m+[0m[0m subnet_ids             = [
          [32m+[0m[0m "subnet-1",
          [32m+[0m[0m "subnet-2",
          [32m+[0m[0m "subnet-3",
        ]
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Name"        = "my-app-eks-x86"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Name"                = "my-app-eks-x86"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m version                = "1.31"

      [32m+[0m[0m launch_template {
          [32m+[0m[0m id      = (known after apply)
          [32m+[0m[0m name    = (known after apply)
          [32m+[0m[0m version = (known after apply)
        }

      [32m+[0m[0m node_repair_config (known after apply)

      [32m+[0m[0m scaling_config {
          [32m+[0m[0m desired_size = 3
          [32m+[0m[0m max_size     = 16
          [32m+[0m[0m min_size     = 2
        }

      [32m+[0m[0m timeouts {}

      [32m+[0m[0m update_config {
          [32m+[0m[0m max_unavailable_percentage = 33
        }
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role" "this" {
      [32m+[0m[0m arn                   = (known after apply)
      [32m+[0m[0m assume_role_policy    = (known after apply)
      [32m+[0m[0m create_date           = (known after apply)
      [32m+[0m[0m force_detach_policies = true
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m managed_policy_arns   = (known after apply)
      [32m+[0m[0m max_session_duration  = 3600
      [32m+[0m[0m name                  = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
      [32m+[0m[0m name_prefix           = (known after apply)
      [32m+[0m[0m path                  = "/"
      [32m+[0m[0m tags                  = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all              = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m unique_id             = (known after apply)

      [32m+[0m[0m inline_policy (known after apply)
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["AmazonEC2ContainerServiceforEC2Role"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchFullAccess"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchFullAccess"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["CloudWatchLogsFullAccess"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchLogsFullAccess"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["additional_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cloudwatch_agent_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["cni_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["ssm_managed_instance_core_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["vpc_resource_controller_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.additional["worker_node_policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "additional" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"][0m will be created
[0m  [32m+[0m[0m resource "aws_iam_role_policy_attachment" "this" {
      [32m+[0m[0m id         = (known after apply)
      [32m+[0m[0m policy_arn = (known after apply)
      [32m+[0m[0m role       = "eks-dev-eu-west-1-cluster-01-infra-01-node-group-role"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.aws_launch_template.this[0][0m will be created
[0m  [32m+[0m[0m resource "aws_launch_template" "this" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m default_version        = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m latest_version         = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "my-app-eks-x86-eks-node-group-"
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Environment" = "dev"
          [32m+[0m[0m "Terragrunt"  = "true"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification" = "internal"
          [32m+[0m[0m "Environment"         = "dev"
          [32m+[0m[0m "Managed-by"          = "terragrunt"
          [32m+[0m[0m "Organization"        = "genopsx"
          [32m+[0m[0m "Terragrunt"          = "true"
        }
      [32m+[0m[0m update_default_version = true
        [90m# (2 unchanged attributes hidden)[0m[0m

      [32m+[0m[0m block_device_mappings {
          [32m+[0m[0m device_name = "/dev/xvda"

          [32m+[0m[0m ebs (known after apply)
        }

      [32m+[0m[0m metadata_options {
          [32m+[0m[0m http_endpoint               = "enabled"
          [32m+[0m[0m http_protocol_ipv6          = (known after apply)
          [32m+[0m[0m http_put_response_hop_limit = 2
          [32m+[0m[0m http_tokens                 = "required"
          [32m+[0m[0m instance_metadata_tags      = "enabled"
        }

      [32m+[0m[0m monitoring {
          [32m+[0m[0m enabled = true
        }

      [32m+[0m[0m network_interfaces {
          [32m+[0m[0m associate_public_ip_address = "true"
          [32m+[0m[0m delete_on_termination       = "true"
          [32m+[0m[0m security_groups             = (known after apply)
        }

      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "instance"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dev"
              [32m+[0m[0m "Name"        = "my-app-eks-x86"
              [32m+[0m[0m "Terragrunt"  = "true"
            }
        }
      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "network-interface"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dev"
              [32m+[0m[0m "Name"        = "my-app-eks-x86"
              [32m+[0m[0m "Terragrunt"  = "true"
            }
        }
      [32m+[0m[0m tag_specifications {
          [32m+[0m[0m resource_type = "volume"
          [32m+[0m[0m tags          = {
              [32m+[0m[0m "Environment" = "dev"
              [32m+[0m[0m "Name"        = "my-app-eks-x86"
              [32m+[0m[0m "Terragrunt"  = "true"
            }
        }
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group.this_name_prefix[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this_name_prefix" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for ALB ingress"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "alb-ingress-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"                                                        = "alb-ingress"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification"                                         = "internal"
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Managed-by"                                                  = "terragrunt"
          [32m+[0m[0m "Name"                                                        = "alb-ingress"
          [32m+[0m[0m "Organization"                                                = "genopsx"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m vpc_id                 = "vpc-1234"

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "15m"
          [32m+[0m[0m delete = "45m"
        }
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all outgoing connections to everywhere"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow HTTP traffic"
      [32m+[0m[0m from_port                = 80
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 80
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[1][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow SSH traffic"
      [32m+[0m[0m from_port                = 22
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 22
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[2][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow HTTPS traffic"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[3][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow 8443 HTTPS traffic"
      [32m+[0m[0m from_port                = 8443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[4][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow 8080 HTTP traffic"
      [32m+[0m[0m from_port                = 8080
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8080
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 80
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 80
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[1][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[2][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 8443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[3][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 8080
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 8080
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_alb_ingress.module.security_group.aws_security_group_rule.ingress_with_self[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_self" {
      [32m+[0m[0m description              = "Allow all incoming connections from this security group"
      [32m+[0m[0m from_port                = -1
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "0"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_node.module.security_group.aws_security_group.this_name_prefix[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group" "this_name_prefix" {
      [32m+[0m[0m arn                    = (known after apply)
      [32m+[0m[0m description            = "Security group for nodes"
      [32m+[0m[0m egress                 = (known after apply)
      [32m+[0m[0m id                     = (known after apply)
      [32m+[0m[0m ingress                = (known after apply)
      [32m+[0m[0m name                   = (known after apply)
      [32m+[0m[0m name_prefix            = "node-"
      [32m+[0m[0m owner_id               = (known after apply)
      [32m+[0m[0m revoke_rules_on_delete = false
      [32m+[0m[0m tags                   = {
          [32m+[0m[0m "Name"                                                        = "node"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m tags_all               = {
          [32m+[0m[0m "Data-classification"                                         = "internal"
          [32m+[0m[0m "Environment"                                                 = "dev"
          [32m+[0m[0m "Managed-by"                                                  = "terragrunt"
          [32m+[0m[0m "Name"                                                        = "node"
          [32m+[0m[0m "Organization"                                                = "genopsx"
          [32m+[0m[0m "kubernetes.io/cluster/eks-dev-eu-west-1-cluster-01-infra-01" = "owned"
        }
      [32m+[0m[0m vpc_id                 = "vpc-1234"

      [32m+[0m[0m timeouts {
          [32m+[0m[0m create = "15m"
          [32m+[0m[0m delete = "45m"
        }
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.egress_with_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow all outgoing connections to everywhere"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.egress_with_ipv6_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "egress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "egress"
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.ingress_with_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_cidr_blocks" {
      [32m+[0m[0m cidr_blocks              = [
          [32m+[0m[0m "0.0.0.0/0",
        ]
      [32m+[0m[0m description              = "Allow HTTPS traffic from EKS to EKS (internal calls)"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.ingress_with_ipv6_cidr_blocks[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_ipv6_cidr_blocks" {
      [32m+[0m[0m description              = "Service ports (ipv6)"
      [32m+[0m[0m from_port                = 443
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m ipv6_cidr_blocks         = [
          [32m+[0m[0m "::/0",
        ]
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "tcp"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 443
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.ingress_with_self[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_self" {
      [32m+[0m[0m description              = "Allow all incoming connections from this security group"
      [32m+[0m[0m from_port                = -1
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "0"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = true
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.security_node.module.security_group.aws_security_group_rule.ingress_with_source_security_group_id[0][0m will be created
[0m  [32m+[0m[0m resource "aws_security_group_rule" "ingress_with_source_security_group_id" {
      [32m+[0m[0m description              = "Allow all incoming connections from ALB security group"
      [32m+[0m[0m from_port                = 0
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m prefix_list_ids          = []
      [32m+[0m[0m protocol                 = "-1"
      [32m+[0m[0m security_group_id        = (known after apply)
      [32m+[0m[0m security_group_rule_id   = (known after apply)
      [32m+[0m[0m self                     = false
      [32m+[0m[0m source_security_group_id = (known after apply)
      [32m+[0m[0m to_port                  = 0
      [32m+[0m[0m type                     = "ingress"
    }

[1m  # module.nodes["my-app-eks-x86"].module.eks_managed_node_groups.module.user_data.null_resource.validate_cluster_service_cidr[0m will be created
[0m  [32m+[0m[0m resource "null_resource" "validate_cluster_service_cidr" {
      [32m+[0m[0m id = (known after apply)
    }

[1mPlan:[0m 96 to add, 0 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m acm_certificate_arn                           = (known after apply)
  [32m+[0m[0m cloudwatch_log_group_arn                      = (known after apply)
  [32m+[0m[0m cloudwatch_log_group_name                     = "/aws/eks/eks-dev-eu-west-1-cluster-01-infra-01/cluster"
  [32m+[0m[0m clsuter_iam_role_name                         = "eks-dev-eu-west-1-cluster-01-infra-01-cluster"
  [32m+[0m[0m cluster_arn                                   = (known after apply)
  [32m+[0m[0m cluster_certificate_authority_data            = (known after apply)
  [32m+[0m[0m cluster_endpoint                              = (known after apply)
  [32m+[0m[0m cluster_iam_role_arn                          = (known after apply)
  [32m+[0m[0m cluster_id                                    = (known after apply)
  [32m+[0m[0m cluster_identity_providers                    = {}
  [32m+[0m[0m cluster_ip_family                             = "ipv4"
  [32m+[0m[0m cluster_name                                  = "eks-dev-eu-west-1-cluster-01-infra-01"
  [32m+[0m[0m cluster_oidc_issuer_url                       = (known after apply)
  [32m+[0m[0m cluster_oidc_provider                         = (known after apply)
  [32m+[0m[0m cluster_oidc_provider_arn                     = (known after apply)
  [32m+[0m[0m cluster_platform_version                      = (known after apply)
  [32m+[0m[0m cluster_primary_security_group_id             = (known after apply)
  [32m+[0m[0m cluster_region                                = "eu-west-1"
  [32m+[0m[0m cluster_service_cidr                          = (known after apply)
  [32m+[0m[0m cluster_status                                = (known after apply)
  [32m+[0m[0m cluster_token                                 = (sensitive value)
  [32m+[0m[0m cluster_version                               = "1.31"
  [32m+[0m[0m combined_primary_and_nodes_security_group_ids = [
      [32m+[0m[0m (known after apply),
      [32m+[0m[0m (known after apply),
    ]
  [32m+[0m[0m node_security_group_arn                       = (known after apply)
  [32m+[0m[0m node_security_group_id                        = (known after apply)
  [32m+[0m[0m r53_zone_id                                   = (known after apply)
  [32m+[0m[0m r53_zone_name                                 = "eks-dev-eu-west-1-cluster-01-infra-01.genopsx.com"
  [32m+[0m[0m vpc_id                                        = "vpc-1234"

# ```